HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_VADC_EMUXSEL_EMUXGRP1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_VADC_G_ALIAS_ALIAS0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_VADC_G_ALIAS_ALIAS1_OFF (8)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ANONC */
#define IFX_VADC_G_ARBCFG_ANONC_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ANONS */
#define IFX_VADC_G_ARBCFG_ANONS_OFF (16)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ARBM */
#define IFX_VADC_G_ARBCFG_ARBM_OFF (7)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.ARBRND */
#define IFX_VADC_G_ARBCFG_ARBRND_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.BUSY */
#define IFX_VADC_G_ARBCFG_BUSY_OFF (30)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CAL */
#define IFX_VADC_G_ARBCFG_CAL_OFF (28)

/** \\brief  Length for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_OFF (31)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_OFF (24)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_OFF (25)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_OFF (26)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_OFF (3)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_OFF (7)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_OFF (11)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_OFF (8)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_OFF (20)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_OFF (16)

/** \\brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_OFF (23)

