HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV14NP */
#define IFX_VADC_G_REVNP1_REV14NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV15NP */
#define IFX_VADC_G_REVNP1_REV15NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV8NP */
#define IFX_VADC_G_REVNP1_REV8NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV9NP */
#define IFX_VADC_G_REVNP1_REV9NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFCLR_Bits.SEV0 */
#define IFX_VADC_G_SEFCLR_SEV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFCLR_Bits.SEV1 */
#define IFX_VADC_G_SEFCLR_SEV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFLAG_Bits.SEV0 */
#define IFX_VADC_G_SEFLAG_SEV0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SEFLAG_Bits.SEV1 */
#define IFX_VADC_G_SEFLAG_SEV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_SEVNP_Bits.SEV0NP */
#define IFX_VADC_G_SEVNP_SEV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_SEVNP_Bits.SEV1NP */
#define IFX_VADC_G_SEVNP_SEV1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR0 */
#define IFX_VADC_G_SRACT_AGSR0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR1 */
#define IFX_VADC_G_SRACT_AGSR1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_LEN (1)

