HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR2 */
#define IFX_VADC_G_SRACT_AGSR2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.AGSR3 */
#define IFX_VADC_G_SRACT_AGSR3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR0 */
#define IFX_VADC_G_SRACT_ASSR0_OFF (8)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR1 */
#define IFX_VADC_G_SRACT_ASSR1_OFF (9)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR2 */
#define IFX_VADC_G_SRACT_ASSR2_OFF (10)

/** \\brief  Length for Ifx_VADC_G_SRACT_Bits.ASSR3 */
#define IFX_VADC_G_SRACT_ASSR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SRACT_Bits.ASSR3 */
#define IFX_VADC_G_SRACT_ASSR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SRACT_Bits.ASSR3 */
#define IFX_VADC_G_SRACT_ASSR3_OFF (11)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_VADC_G_SYNCTR_EVALR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_VADC_G_SYNCTR_EVALR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_VADC_G_SYNCTR_EVALR1_OFF (4)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_VADC_G_SYNCTR_EVALR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_VADC_G_SYNCTR_EVALR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_VADC_G_SYNCTR_EVALR2_OFF (5)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_VADC_G_SYNCTR_EVALR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_VADC_G_SYNCTR_EVALR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_VADC_G_SYNCTR_EVALR3_OFF (6)

/** \\brief  Length for Ifx_VADC_G_SYNCTR_Bits.STSEL */
#define IFX_VADC_G_SYNCTR_STSEL_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_SYNCTR_Bits.STSEL */
#define IFX_VADC_G_SYNCTR_STSEL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_SYNCTR_Bits.STSEL */
#define IFX_VADC_G_SYNCTR_STSEL_OFF (0)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_OFF (10)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF11 */
#define IFX_VADC_G_VFR_VF11_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF11 */
#define IFX_VADC_G_VFR_VF11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF11 */
#define IFX_VADC_G_VFR_VF11_OFF (11)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF12 */
#define IFX_VADC_G_VFR_VF12_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF12 */
#define IFX_VADC_G_VFR_VF12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF12 */
#define IFX_VADC_G_VFR_VF12_OFF (12)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF6 */
#define IFX_VADC_G_VFR_VF6_LEN (1)

